{"products":[{"id":"0","year":"2014","author":"Майкл Миковски, Джош Пауэлл","name":"Single Page Web Applications23","image_url":"https://books.google.com.ua/books/content?id=XVUHCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE70Uf4iyWU3S97Zrtl9ve8uC0JchFaKVqAe82PPjpo_WshNfaCTDLb-M7tLecpWjfzgRtMdHaFpWiHsGzo_VOXN7ks2HyFDq5RwQ4neaOfONVZ-bkF0DTlDNEKSb9Zad7f6c5KEv","except":"Если ваш сайт представляет собой набор дергающихся страниц, связанных ссылками, то вы отстали от жизни. Следующей ступенью вашей карьеры должны стать одностраничные приложения (SPA). В таком приложении отрисовка пользовательского интерфейса и бизнес-логика перенесены в браузер, а взаимодействие с сервером сводится к синхронизации данных. Пользователь работает с таким сайтом, как с персональным приложением на рабочем столе, что гораздо удобнее и приятнее. Однако разрабатывать, сопровождать и ","content":"Если ваш сайт представляет собой набор дергающихся страниц, связанных ссылками, то вы отстали от жизни. Следующей ступенью вашей карьеры должны стать одностраничные приложения (SPA). В таком приложении отрисовка пользовательского интерфейса и бизнес-логика перенесены в браузер, а взаимодействие с сервером сводится к синхронизации данных. Пользователь работает с таким сайтом, как с персональным приложением на рабочем столе, что гораздо удобнее и приятнее. Однако разрабатывать, сопровождать и тестировать SPA нелегко. В этой книге показано как организуется командная разработка передовых SPA – проектирование, тестирование, сопровождение и развитие – с применением JavaScript на всех уровнях и без привязки к какому-то конкретному каркасу.Попутно вы отточите навыки работы с HTML5, CSS3 и JavaScript и узнаете об использовании JavaScript не только в браузере, но также на сервере и в базе данных."},{"id":"1","name":"C Primer Plus","author":"Stephen Prata","year":"2013","image_url":"https://books.google.com.ua/books/content?id=MAAuAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72C5pfY4j0CFOzwtXD5htHgqYVDWd-ZUTkwYQYZloOSf5fzlbwlmS8ePUPi4LiE2ZlZQF7SFo2q81ZWY01vWOn2jAtHxag4mKtjGaFcJk2hyRcddPyhbiBB_MdyNWKYpb8j9rlH","content":"C Primer Plus is a carefully tested, well-crafted, and complete tutorial on a subject core to programmers and developers. This computer science classic teaches principles of programming, including structured code and top-down design.\n\n \n\nAuthor and educator Stephen Prata has created an introduction to C that is instructive, clear, and insightful. Fundamental programming concepts are explained along with details of the C language. Many short, practical examples illustrate just one or two concepts at a time, encouraging readers to master new topics by immediately putting them to use.\n\n \n\nReview questions and programming exercises at the end of each chapter bring out the most critical pieces of information and help readers understand and digest the most difficult concepts. A friendly and easy-to-use self-study guide, this book is appropriate for serious students of programming, as well as developers proficient in other languages with a desire to better understand the fundamentals of this core language.\n\n \n\nThe sixth edition of this book has been updated and expanded to cover the latest developments in C as well as to take a detailed look at the new C11 standard. In C Primer Plus you’ll find depth, breadth, and a variety of teaching techniques and tools to enhance your learning:\n\n \n\nComplete, integrated discussion of both C language fundamentals and additional features\nClear guidance about when and why to use different parts of the language\nHands-on learning with concise and simple examples that develop your understanding of a concept or two at a time\nHundreds of practical sample programs\nReview questions and programming exercises at the end of each chapter to test your understanding\nCoverage of generic C to give you the greatest flexibility"},{"id":"2","name":"JavaScript и AJAX в Web-дизайне","author":"Дронов Владимир","year":"2012","image_url":"https://books.google.com.ua/books/content?id=w2ZE-ObL8IMC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72lJZyTD1F5JQ4RZd0FrB6zOoPI_m2WXzTGqmbE-l2kluadOeb8be6U34vhne5dalK0QH7dT0Q8OyMoUkpY93lznQ8_yWrNBOrElgbg1LaZruC_Nd5yxZBRyoDqdk5nyH_M20ty","content":"В книге описывается все, что должен знать Web-дизайнер: принципы создания Web-страниц, язык JavaScript, основы написания Web-сценариев, работа с содержимым Web-страницы, обработка данных, введенных в Web-форму, особенности различных Web-обозревателей, использование баз данных, фильтров и преобразований, графика, анимация и пр. Изложение сопровождается большим количеством подробно разобранных примеров и полезных советов. Особое внимание уделено вопросам совместимости Web-сценариев с различными Web-обозревателями. Второе издание книги, ранее выходившей под названием \"JavaScript в Web-дизайне\", полностью переработано и дополнено с учетом современных технологий, дан вводный курс AJAX."}]}